#concat()

In [1]:
import pandas as pd

#series...

In [2]:
sr1=pd.Series([0,1,2])
sr1

0    0
1    1
2    2
dtype: int64

In [3]:
sr2=pd.Series([3,4,5])
sr2

0    3
1    4
2    5
dtype: int64

In [4]:
pd.concat([sr1,sr2])

0    0
1    1
2    2
0    3
1    4
2    5
dtype: int64

In [5]:
sr3=pd.Series([3,4,5,6,7])
sr3

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [6]:
pd.concat([sr1,sr3])

0    0
1    1
2    2
0    3
1    4
2    5
3    6
4    7
dtype: int64

#DataFrame..

In [7]:
df1=pd.DataFrame({'id':[1,2,3,4],
                  'name':['A','B','C','D'],
                  'class':[5,6,7,8]

    
})
df1

   id name  class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [8]:
df2=pd.DataFrame({'id':[5,6,7,8],
                  'name':['E','F','G','H'],
                  'class':[9,10,11,12]

    
})
df2

   id name  class
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [9]:
pd.concat([df1,df2])

   id name  class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12

In [10]:
pd.concat([df1,df2],axis=1)

   id name  class  id name  class
0   1    A      5   5    E      9
1   2    B      6   6    F     10
2   3    C      7   7    G     11
3   4    D      8   8    H     12

In [11]:
df3=pd.DataFrame({'id':[5,6,7,8,9],
                  'name':['E','F','G','H','I'],
                  'class':[9,10,11,12,13]

    
})
df3

   id name  class
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12
4   9    I     13

In [12]:
pd.concat([df1,df3],axis=1)

    id name  class  id name  class
0  1.0    A    5.0   5    E      9
1  2.0    B    6.0   6    F     10
2  3.0    C    7.0   7    G     11
3  4.0    D    8.0   8    H     12
4  NaN  NaN    NaN   9    I     13

In [13]:
pd.concat([df1,df3],axis=0)

   id name  class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   5    E      9
1   6    F     10
2   7    G     11
3   8    H     12
4   9    I     13

#to make the index systematic

In [14]:
pd.concat([df1,df3],axis=0,ignore_index=True)

   id name  class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
4   5    E      9
5   6    F     10
6   7    G     11
7   8    H     12
8   9    I     13